Tekla Open API Reference for Tekla Structures 2025
Identifier Constructor (Int32)
 Constructs an identifier with the given ID.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier(
	int id
)
Public Sub New (
	id As Integer
)
Parameters
id
Type: System.Int32
The ID to be used.
See Also
Reference
Identifier Class
Identifier Overload
Tekla.Structures Namespace